# read design
read_verilog fft8.v
hierarchy -check
hierarchy -top fft8
#flatten
# high level synthesis
proc; opt; clean
fsm; opt; clean
memory; opt; clean
# low level synthesis
techmap; opt; clean
# map to target architecture
dfflibmap -liberty stdcells.lib
abc -liberty stdcells.lib
# split larger signals
splitnets -ports; opt; clean
# write synthesis output
write_verilog synthfft.v
write_spice synthfft.sp
# print synthesis reports
stat
stat -liberty stdcells.lib